Config/Enums/ВидыРБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеисключительныеПраваПользованияНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсвоениеПриродныхРесурсов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочноеСтрахованиеЖизни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрахованиеНаОплатуМедицинскихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрахованиеНаСлучайСмертиИУтратыРаботоспособности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВидыСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиОтРеализацииАмортизируемогоИмущества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиПрошлыхЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпущеннаяВыгодаПоДоговорамАрендыНаЛьготныхУсловиях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыРБП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДопустимыеВидыРБП(ПлательщикНалогаНаПрибыль) Экспорт
	
	ДопустимыеВидыРБП = Новый Массив;
	Для Каждого ВидРБП Из Перечисления.ВидыРБП Цикл
		
		Если НЕ ПлательщикНалогаНаПрибыль
			И ( ВидРБП = Перечисления.ВидыРБП.УбыткиПрошлыхЛет
			ИЛИ ВидРБП = Перечисления.ВидыРБП.УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств
			ИЛИ ВидРБП = Перечисления.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества
			ИЛИ ВидРБП = Перечисления.ВидыРБП.НеисключительныеПраваПользованияНМА) Тогда
			Продолжить;
		КонецЕсли;
		
		ДопустимыеВидыРБП.Добавить(ВидРБП);
		
	КонецЦикла;
	
	Возврат ДопустимыеВидыРБП;
	
КонецФункции

#КонецОбласти

#КонецЕсли
